<a href="https://colab.research.google.com/github/institutohumai/cursos-python/blob/master/AnalisisDeDatos/1_Indexing/Indexing.ipynb"> <img src='https://colab.research.google.com/assets/colab-badge.svg' /> </a>
<div align="center"> Recordá abrir en una nueva pestaña </div>

In [54]:
# Siempre al principio, importamos las librerías.
import pandas as pd
import numpy as np

# Tabla de Contenidos

    I. Análisis de datos con Pandas
    II. Los objetos fundamentales de Pandas
        I. Series
        II. DataFrames
        III. Índices
    III. Exploración
        I. Filtrando un DataFrame (Indexing)
            I. Boolean Indexing
                I. Máscara booleana
                II. Máscara booleana con muchas condiciones
            II. Boolean indexing con query()
            III. Fancy Indexing
        II. Funciones de Agregación
    IV. Otros análisis descriptivos
        I. Para las variables numéricas
        II. Para las variables categóricas
        III. Ordenar por columnas y limitar la cantidad de resultados
    V. Anexo: volviendo al tema de la vectorización

# Exploración

Vamos a analizar datos de una fuente real. Los ingresos de los funcionarios son información pública que se libera anualmente en el <a href='https://data.buenosaires.gob.ar/dataset/sueldo-funcionarios'>portal de datos abiertos</a> de GCBA.  

En general los 4 primeros pasos para analizar un data set son:
1. Leerlo
2. Consultar cuáles son las columnas
3. Extraer una muestra
4. Verificar cuántos registros tiene

## 1- Para leer el data set usamos la función de pandas read_csv

Con esta función podemos leer archivos que estén en una url pública o en una ubicación del disco accesible desde la Jupyter Notebook.

In [55]:
df = pd.read_csv('http://cdn.buenosaires.gob.ar/datosabiertos/datasets/sueldo-funcionarios/sueldo_funcionarios_2019.csv')

## 2- Consultamos las columnas

In [56]:
df.columns

Index(['cuil', 'anio', 'mes', 'funcionario_apellido', 'funcionario_nombre',
       'reparticion', 'asignacion_por_cargo_i', 'aguinaldo_ii',
       'total_salario_bruto_i_+_ii', 'observaciones'],
      dtype='object')

## 3- Extraemos una muestra

In [57]:
df.sample(5)

              cuil  anio  ...  total_salario_bruto_i_+_ii observaciones
10   20-24941711-5  2019  ...                   224516.62           NaN
326  27-17593512-1  2019  ...                   267913.50           NaN
319  20-17110752-1  2019  ...                   275089.75           NaN
126  20-17692128-6  2019  ...                   217520.38           NaN
153  27-26690980-8  2019  ...                   226866.41           NaN

[5 rows x 10 columns]

## 4- Consultamos la cantidad de filas y de columnas

In [58]:
# La propiedad shape nos devuelve una tupla (filas,columnas)
df.shape

(385, 10)

# Vectorización con Pandas

Pandas es una de las librerías de Python más usadas para análisis de datos. El nombre pandas viene de "Panel Data Analysis" y su funcionalidad permite hacer operaciones sobre datos que se encuentran en memoria de manera eficiente. 

Pandas es útil para trabajar sobre datos tabulares, con dos condiciones importantes:

I. Los datos se encuentran enteramente en la memoria RAM. Con lo cual, el tamaño de los datos que podemos manipular está limitado por el hardware. Como regla de pulgar, es una buena práctica no ocupar más de 1/3 de la memoria RAM de nuestro dispositivo con el dataset. Así, si estamos trabajando localmente en una notebook con 8GB de memoria RAM no es recomendable procesar datasets de más de 2.33GB.

II. En pandas, las operaciones sobre filas y columnas son, en general, eficientes porque se hacen de forma "vectorizada". En realidad esta optimización, se hace desde numpy, una librería para realizar operaciones matemáticas que se utilizó a su vez para escribir pandas. 

Las operaciones vectorizadas son las que se realizan en bloque en vez de caso por caso. Las computadoras de hoy tienen la capacidad de recibir muchas instrucciones juntas y procesar varias de ellas a la vez. Por ejemplo, si nuestro hardware tiene la capacidad de procesar 4 operaciones juntas, el resultado de vectorizar una operación matemática es el siguiente:

<img src = 'https://datasets-humai.s3.amazonaws.com/images/vectorizacion.png' /> 


En el primer caso hay que hacer 5 operaciones y en el segundo caso sólo dos.

Es importante entender, entonces, que Pandas trabaja de esta manera y que por eso es una de las herramientas más elegidas para manipular datos en memoria.



# Los objetos fundamentales de Pandas

## Series

Las series son "columnas" que de una tabla que están asociadas a un índice y a un nombre. Igual que una lista común de Python es una secuencia de elementos ordenados, pero a diferencia de la lista está asociada a más información.

In [59]:
# Las series se pueden crear a partir de una lista
serie = pd.Series(['a','b','c'])

In [60]:
# Propiedades importantes de las series
print('Tipo de objetos que tiene ', serie.dtype)
print('Nombre ', serie.name)
print('Index ',serie.index)
print('Valores ',serie.values)

Tipo de objetos que tiene  object
Nombre  None
Index  RangeIndex(start=0, stop=3, step=1)
Valores  ['a' 'b' 'c']

## DataFrames

Los DataFrames son "tablas", compuestas por varias "columnas" o series que comparten todas un mismo índice. En general los DataFrames se crean a partir de leer tablas de archivos (pueden ser en formato json o csv) pero a veces también se crean a partir de listas de diccionarios o de otras maneras. 

Los DataFrames tienen un objeto Index que describe los nombres de columnas y otro objeto Index que describen los nombres de las filas.

In [89]:
# Leemos un dataset público
df = pd.read_csv('http://cdn.buenosaires.gob.ar/datosabiertos/datasets/sueldo-funcionarios/sueldo_funcionarios_2019.csv')

In [63]:
# Propiedades importantes de los dataframes
print('Columnas ', df.columns)
print('Index ', df.index)
print('Dimensiones ',df.shape)

Columnas  Index(['cuil', 'anio', 'mes', 'funcionario_apellido', 'funcionario_nombre',
       'reparticion', 'asignacion_por_cargo_i', 'aguinaldo_ii',
       'total_salario_bruto_i_+_ii', 'observaciones'],
      dtype='object')
Index  RangeIndex(start=0, stop=385, step=1)
Dimensiones  (385, 10)

In [64]:
# Consultar las primeras filas
df.head()

            cuil  anio  ...  total_salario_bruto_i_+_ii observaciones
0  20-17692128-6  2019  ...                   197745.80           NaN
1  20-17735449-0  2019  ...                   197745.80           NaN
2  27-24483014-0  2019  ...                   224516.62           NaN
3  20-13872301-2  2019  ...                   224516.62           NaN
4  20-25641207-2  2019  ...                   224516.62           NaN

[5 rows x 10 columns]

Si queremos extraer una serie del DataFrame, podemos hacerlo de la misma forma en que extraemos un valor de un diccionario.

In [65]:
serie_mes = df['mes']

In [66]:
type(serie_mes)

pandas.core.series.Series

## Índices

Los índices acompañan a las series y a los Data Frames. Son conjuntos ordenados e inmutables de elementos

In [71]:
df.index

RangeIndex(start=0, stop=385, step=1)

In [72]:
df.columns

Index(['cuil', 'anio', 'mes', 'funcionario_apellido', 'funcionario_nombre',
       'reparticion', 'asignacion_por_cargo_i', 'aguinaldo_ii',
       'total_salario_bruto_i_+_ii', 'observaciones'],
      dtype='object')

In [73]:
ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [81]:
ind[1] = 0

TypeError: ignored

### Ejercicio
Exploren el dataset público que se encuentra en la siguiente url: https://datasets-humai.s3.amazonaws.com/datasets/titanic.csv ¿De qué se trata? ¿Cuántas filas tiene? ¿Cuántas columnas? Al leerlo, pueden almacenarlo en la variable df_titanic.

In [108]:
df_titanic = pd.read_csv('https://datasets-humai.s3.amazonaws.com/datasets/titanic.csv', sep='|')
df_titanic.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [111]:
filas = df_titanic.shape[0]
filas

891

In [112]:
columnas = df_titanic.shape[1]
columnas

12

## Filtrando un DataFrame (Indexing)

Hay muchas técnicas para filtrar un DataFrame. Podemos querer filtrar por columnas o por filas, por posición o por nombre. También podemos querer filtrar por condiciones que se cumplen o no. Cuando no queremos filtrar sobre una dimensión (filas o columnas) usamos ":" para seleccionar todo.


<img src='https://github.com/institutohumai/cursos-python/blob/master/AnalisisDeDatos/1_Indexing/img/indexing.png?raw=1' style='height:350px' />

### Boolean Indexing

Supongamos que queremos tomar el dataset de funcionarios y quedarnos únicamente con los que pertenecen al Ministerio de Cultura.
Para eso lo que hacemos es indexar al DataFrame por una condición booleana. Eso implica que debemos crear una serie compuesta por valores True y False para aplicarla como índice a las filas.

Los operadores que sirven para evaluar condiciones sobre las series son:


| S  | Descripción   | S  | Descripción   |   |
|----|---------------|----|---------------|---|
| >= | Mayor o Igual | <= | Menor o Igual |   |
| == | Igual         | != | Distinto      |   |
| >  | Mayor         | <  | Menor         |   |

#### Máscara booleana

Veamos lo que pasa cuando le aplicamos a una serie una condición que devuelve un booleano

In [113]:
df['anio'] != 2019

0      False
1      False
2      False
3      False
4      False
       ...
380    False
381    False
382    False
383    False
384    False
Name: anio, Length: 385, dtype: bool

In [114]:
mascara_booleana = df['anio'] != 2019

Nos devuelve una serie de la misma longitud que la original y que contiene sólo valores True o False.

In [115]:
type(mascara_booleana)

pandas.core.series.Series

In [116]:
mascara_booleana.shape

(385,)

In [117]:
mascara_booleana.dtype

dtype('bool')

Ahora seleccionemos entonces, los registros que corresponden al Ministerio de Cultura.

In [118]:
df_min_cul = df.loc[df['reparticion'] == 'Ministerio de Cultura',:]
df_min_cul.head()

              cuil  anio  ...  total_salario_bruto_i_+_ii observaciones
4    20-25641207-2  2019  ...                   224516.62           NaN
36   20-25641207-2  2019  ...                   224516.62           NaN
68   20-25641207-2  2019  ...                   231167.76           NaN
99   20-25641207-2  2019  ...                   249661.60           NaN
130  20-25641207-2  2019  ...                   249661.60           NaN

[5 rows x 10 columns]

In [119]:
# Veamos la cantidad de casos
df_min_cul.shape

(12, 10)

Algo que puede llegar a confundir sobre el Indexing en Pandas es que en algunos casos se puede ser menos explícito a la hora de filtrar. Por ejemplo si ponemos una condición Booleana, pandas asume que el tipo de indexing es loc y que el filtro es sobre las filas y no sobre las columnas:

In [121]:
df_min_cul = df[df['reparticion'] == 'Ministerio de Cultura']
df_min_cul.head()

              cuil  anio  ...  total_salario_bruto_i_+_ii observaciones
4    20-25641207-2  2019  ...                   224516.62           NaN
36   20-25641207-2  2019  ...                   224516.62           NaN
68   20-25641207-2  2019  ...                   231167.76           NaN
99   20-25641207-2  2019  ...                   249661.60           NaN
130  20-25641207-2  2019  ...                   249661.60           NaN

[5 rows x 10 columns]

In [106]:
df_min_cul.shape

(12, 10)

Probemos con otra condición.

### Ejercicio

Traer todos los sueldos de la segunda mitad del año...

In [128]:
#df_segunda_mitad = df.loc[df['mes']>6, :]
df_segunda_mitad = df[df['mes']>6]
df_segunda_mitad

              cuil  anio  ...  total_salario_bruto_i_+_ii        observaciones
188  20-17692128-6  2019  ...                   228396.40                  NaN
189  20-17735449-0  2019  ...                   228396.40                  NaN
190  27-24483014-0  2019  ...                   263531.98                  NaN
191  20-13872301-2  2019  ...                   263531.98                  NaN
192  20-25641207-2  2019  ...                   263531.98                  NaN
..             ...   ...  ...                         ...                  ...
380  20-26735689-1  2019  ...                   374959.29                  NaN
381  20-23864572-8  2019  ...                   412634.62                  NaN
382  20-21981279-6  2019  ...                   412634.62                  NaN
383  20-30593774-7  2019  ...                   374959.29                  NaN
384  27-27011181-0  2019  ...                   203167.74  alta desde el 10/12

[197 rows x 10 columns]

### Ejercicio
Volviendo al DataFrame del Titanic ¿Cuántos pasajeros sobrevivieron y cuántos no? ¿Cuántos pagaron una tarifa menor a 25?

In [143]:
df_titanic_sobrevivieron = df_titanic.loc[df_titanic['Survived'] == 1]
df_titanic_no_sobrevivieron = df_titanic.loc[df_titanic['Survived'] == 0]
#df_titanic.columns
df_titanic.head(2)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C

[2 rows x 12 columns]

In [140]:
print('sobrevivieron',df_titanic_sobrevivieron.shape[0],'personas')
print('murieron',df_titanic_no_sobrevivieron.shape[0],'personas')

sobrevivieron 342 personas
murieron 549 personas

In [145]:
df_titanic['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [148]:
df_titanic_baja_tarifa = df_titanic.loc[df_titanic['Fare']<25]
df_titanic_baja_tarifa

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
2              3         1       3  ...   7.9250   NaN         S
4              5         0       3  ...   8.0500   NaN         S
5              6         0       3  ...   8.4583   NaN         Q
7              8         0       3  ...  21.0750   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
883          884         0       2  ...  10.5000   NaN         S
884          885         0       3  ...   7.0500   NaN         S
886          887         0       2  ...  13.0000   NaN         S
888          889         0       3  ...  23.4500   NaN         S
890          891         0       3  ...   7.7500   NaN         Q

[557 rows x 12 columns]

In [152]:
df_titanic_baja_tarifa.shape[0]

557

#### Máscara booleana con muchas condiciones

Ahora tratemos de filtrar el dataset por dos condiciones: por ejemplo tomar los sueldos de abril de la secretaria de innovación. 
Para eso tenemos que combinar dos máscaras booleanas con una condición.

| S | Descripcion        | S  | Descripcion |   |
|---|--------------------|----|-------------|---|
| & | AND (y)            | \| | OR (o)      |   |
| ^ | XOR (o exclusivo)  | ~  | NOT (no)    |   |



Por ejemplo: seleccionemos los casos donde o bien se haya cobrado aguinaldo o bien el salario total haya sido mayor que 240.000, pero no las dos cosas.

In [153]:
df[(df['total_salario_bruto_i_+_ii'] > 240000) ^ (df['aguinaldo_ii'] > 0)]

              cuil  anio  ...  total_salario_bruto_i_+_ii        observaciones
55   20-26781618-3  2019  ...                   238020.15       baja 28/2/2019
97   27-24483014-0  2019  ...                   249661.60                  NaN
98   20-13872301-2  2019  ...                   249661.60                  NaN
99   20-25641207-2  2019  ...                   249661.60                  NaN
100  27-13221055-7  2019  ...                   249661.60                  NaN
..             ...   ...  ...                         ...                  ...
360  20-28908968-4  2019  ...                   185396.54         baja al 9/12
361  20-28908968-4  2019  ...                   203167.74  alta desde el 10/12
362  20-24424714-9  2019  ...                   185396.54         baja al 9/12
363  20-24424714-9  2019  ...                   203167.74  alta desde el 10/12
384  27-27011181-0  2019  ...                   203167.74  alta desde el 10/12

[170 rows x 10 columns]

Ahora veamos los sueldos de febrero de la SECR Ciencia, Tecnologia e Innovacion.

In [154]:
df[(df['mes'] == 2) & (df['reparticion'] == 'SECR Ciencia, Tecnologia e Innovacion')]

             cuil  anio  ...  total_salario_bruto_i_+_ii   observaciones
55  20-26781618-3  2019  ...                   238020.15  baja 28/2/2019

[1 rows x 10 columns]

### Boolean indexing con query()

La sintaxis que se utiliza para hacer Boolean indexing es un poco repetitiva. Noten que filtrar (aún en su expresión más corta sin loc ni especificar filas o columnas) implica ESCRIBIR DOS VECES el nombre del dataset. Para crear un shortcut, Pandas ofrece la función .query()

In [158]:
df_cult = df.query('reparticion == "Ministerio de Cultura"')
df_cult.head()

              cuil  anio  ...  total_salario_bruto_i_+_ii observaciones
4    20-25641207-2  2019  ...                   224516.62           NaN
36   20-25641207-2  2019  ...                   224516.62           NaN
68   20-25641207-2  2019  ...                   231167.76           NaN
99   20-25641207-2  2019  ...                   249661.60           NaN
130  20-25641207-2  2019  ...                   249661.60           NaN

[5 rows x 10 columns]

También se puede hacer query sobre múltiples condiciones.

In [160]:
df2 = df.query('asignacion_por_cargo_i > 240000 & aguinaldo_ii > 0')
df2.head()

              cuil  anio  ...  total_salario_bruto_i_+_ii observaciones
159  27-24483014-0  2019  ...                   374492.40           NaN
160  20-13872301-2  2019  ...                   414858.36           NaN
161  20-25641207-2  2019  ...                   374492.40           NaN
162  27-13221055-7  2019  ...                   374492.40           NaN
163  27-13092400-5  2019  ...                   374492.40           NaN

[5 rows x 10 columns]

In [161]:
df2.shape

(34, 10)

### Ejercicio: Piensen cómo traducir a la sintaxis de query, estas consultas que ya hicimos:

In [166]:
#df_sem2 = df[df['mes'] > 6]
df_sem2 = df.query('mes > 6')
df_sem2.shape

(197, 10)

In [169]:
# df[(df['mes'] == 2) & (df['reparticion'] == 'SECR Ciencia, Tecnologia e Innovacion')]
df_feb_SECR = df.query('mes == 2 & reparticion == "SECR Ciencia, Tecnologia e Innovacion"')
df_feb_SECR.head()

             cuil  anio  ...  total_salario_bruto_i_+_ii   observaciones
55  20-26781618-3  2019  ...                   238020.15  baja 28/2/2019

[1 rows x 10 columns]

### Fancy Indexing

Ahora vamos a quedarnos con un subconjunto de columnas del DataFrame.

In [171]:
df_view = df.loc[:,['anio','mes']]

In [172]:
df_view.shape

(385, 2)

Existe una forma menos explícita de hacer esta misma operación. Si pasamos una lista al indexing, pandas asume que el tipo de indexing es loc y que el filtro es sobre las columnas y no las filas:

In [173]:
df_view = df[['anio','mes']]

In [174]:
df_view.shape

(385, 2)

Fíjense lo que pasa si tratamos de acceder a filas utilizando una lista de nombres, en este caso [0,1].

In [177]:
# Incorrecto
df_view = df[[3,8]]

KeyError: ignored

Nos da un error porque cuando pasamos únicamente una lista al indexing, pandas asume que queremos un set de columnas y si los nombres no existen, da error. La forma correcta de hacerlo es pasar una lista de índices y explicitar que vamos a indizar con loc y que seleccionamos todas las columnas.

In [178]:
# Correcto
df_view = df.loc[[3,8],:]

In [179]:
df_view

            cuil  anio  ...  total_salario_bruto_i_+_ii observaciones
3  20-13872301-2  2019  ...                   224516.62           NaN
8  20-22293873-3  2019  ...                   224516.62           NaN

[2 rows x 10 columns]

### Ejercicio. Volviendo al ejemplo del titanic...

1) ¿Cuántos hombres y mujeres sobrevivieron? 

2) ¿Cuántos menores de 18 años había? ¿Cuántos sobrevivieron?

3) Seleccionen únicamente las columnas Sex y Survived y almacenenlas en un nuevo DataFrame que se llame df_titanic_subset.

In [186]:
df_titanic.head(1)
df_titanic.query('Sex == "female" & Survived == 1')

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
8              9         1       3  ...  11.1333   NaN         S
9             10         1       2  ...  30.0708   NaN         C
..           ...       ...     ...  ...      ...   ...       ...
874          875         1       2  ...  24.0000   NaN         C
875          876         1       3  ...   7.2250   NaN         C
879          880         1       1  ...  83.1583   C50         C
880          881         1       2  ...  26.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S

[233 rows x 12 columns]

In [187]:
df_titanic.head(1)
df_titanic.query('Sex == "male" & Survived == 1')

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
17            18         1       2  ...  13.0000   NaN         S
21            22         1       2  ...  13.0000   D56         S
23            24         1       1  ...  35.5000    A6         S
36            37         1       3  ...   7.2292   NaN         C
55            56         1       1  ...  35.5000   C52         S
..           ...       ...     ...  ...      ...   ...       ...
838          839         1       3  ...  56.4958   NaN         S
839          840         1       1  ...  29.7000   C47         C
857          858         1       1  ...  26.5500   E17         S
869          870         1       3  ...  11.1333   NaN         S
889          890         1       1  ...  30.0000  C148         C

[109 rows x 12 columns]

In [190]:
df_titanic.head(1)
df_titanic.query('Age < 18 & Survived == 1')

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
9             10         1       2  ...  30.0708   NaN         C
10            11         1       3  ...  16.7000    G6         S
22            23         1       3  ...   8.0292   NaN         Q
39            40         1       3  ...  11.2417   NaN         C
43            44         1       2  ...  41.5792   NaN         C
..           ...       ...     ...  ...      ...   ...       ...
830          831         1       3  ...  14.4542   NaN         C
831          832         1       2  ...  18.7500   NaN         S
853          854         1       1  ...  39.4000   D28         S
869          870         1       3  ...  11.1333   NaN         S
875          876         1       3  ...   7.2250   NaN         C

[61 rows x 12 columns]

In [ ]:
df_titanic.head(1)
df_titanic.query('Sex == "male" & Survived == 1')

In [191]:
df_titanic_subset = df_titanic[['Sex','Survived']]

In [192]:
df_titanic_subset.head()

      Sex  Survived
0    male         0
1  female         1
2  female         1
3  female         1
4    male         0

## Funciones de Agregación

Utilizando Pandas podemos aplicar funciones a nivel de columna. Algunas funciones predefinidas son la media, el desvío estándar y la sumatoria, el valor máximo y el mínimo.

Algunas de las funciones de agregación más comunes son:

<ul>
    <li>min</li>
    <li>max</li>
    <li>count</li>
    <li>sum</li>
    <li>prod</li>
    <li>mean</li>
    <li>median</li>
    <li>mode</li>
    <li>std</li>
    <li>var</li>
</ul>

In [193]:
df['mes'].max()

12

In [194]:
df['asignacion_por_cargo_i'].mean()

234234.3679999999

In [195]:
df['asignacion_por_cargo_i'].std()

35043.16008466176

In [196]:
df['total_salario_bruto_i_+_ii'].sum()

97988834.36000001

Podemos combinar los filtros que vimos antes con las funciones de agregación para responder preguntas cómo ¿Cuál fue en gasto en asignaciones de funcionarios para la Secretaría de Medios 2019? ¿Y para la de Justicia y Seguridad?

In [197]:
df[df['reparticion'] == 'SECR de Medios']['total_salario_bruto_i_+_ii'].sum()

3232402.25

In [198]:
df[df['reparticion'] == 'SECR Justicia y Seguridad']['total_salario_bruto_i_+_ii'].sum()

3029551.7300000004

Ahora respondamos algunas preguntas: ¿Quién o quiénes del dataset cobran el salario más alto? ¿Y el más bajo?

In [199]:
df[df['total_salario_bruto_i_+_ii'] == df['total_salario_bruto_i_+_ii'].max()]

              cuil  anio  ...  total_salario_bruto_i_+_ii observaciones
374  20-13872301-2  2019  ...                   445945.31           NaN

[1 rows x 10 columns]

In [200]:
df[df['total_salario_bruto_i_+_ii'] == df['total_salario_bruto_i_+_ii'].min()]

              cuil  anio  ...  total_salario_bruto_i_+_ii observaciones
344  27-30744939-6  2019  ...                   185396.54  baja al 9/12
348  20-22709722-2  2019  ...                   185396.54  baja al 9/12
354  20-20008464-1  2019  ...                   185396.54  baja al 9/12
358  20-31164337-2  2019  ...                   185396.54  baja al 9/12
360  20-28908968-4  2019  ...                   185396.54  baja al 9/12
362  20-24424714-9  2019  ...                   185396.54  baja al 9/12

[6 rows x 10 columns]

# Otros análisis descriptivos

Pandas viene con algunas funciones built-in para ayudar al análisis descriptivo.

## Para las variables numéricas

In [203]:
df[['asignacion_por_cargo_i','aguinaldo_ii','total_salario_bruto_i_+_ii']].describe()

       asignacion_por_cargo_i   aguinaldo_ii  total_salario_bruto_i_+_ii
count              385.000000     385.000000                  385.000000
mean            234234.368000   20282.084883               254516.452883
std              35043.160085   45248.840725                51434.987870
min              74991.860000       0.000000               185396.540000
25%             224516.620000       0.000000               224516.620000
50%             239470.360000       0.000000               245811.620000
75%             249972.870000       0.000000               263531.980000
max             275089.750000  170855.560000               445945.310000

## Para las variables categóricas

In [204]:
df['reparticion'].value_counts()

SECR Justicia y Seguridad                                         13
SECR Desarrollo Ciudadano                                         13
SECR de Medios                                                    13
Ministerio de Salud                                               13
SS Contenidos                                                     12
Jefatura de Gabinete de Ministros                                 12
Vicejefatura de Gobierno                                          12
SECR Integración Social Para Personas Mayores                     12
SECR Legal y Técnica                                              12
SS Comunicacion                                                   12
SECR Integración Social y Urbana                                  12
SECR Planificación, Evaluación y Coordinación de Gestión          12
SECR Administración de Seguridad y Emergencias                    12
Ministerio de Gobierno                                            12
Ministerio de Cultura                                             12
Jefe de Gobierno                                                  12
UPE Transferencia de Funciones y Facultades en Materia de Seg.    12
Sindicatura General de la Ciudad de Buenos Aires                  12
Consejo de los Derechos de Niñas, Niños y Adoles - Presidencia    12
Ente de Turismo Ley Nº 2627                                       12
Procuración General de la Ciudad de Buenos Aires                  12
Ministerio de Desarrollo Urbano y Transporte                      12
SECR Coordinación General                                         11
Ministerio de Economía y Finanzas                                 11
Ministerio de Hábitat y Desarrollo Humano                         11
SECR Atención y Gestión Ciudadana                                 11
SECR Cultura Ciudadana y Función Pública                          11
SECR Transporte                                                   11
SECR General y de Relaciones Internacionales                      11
Ministerio de Ambiente y Espacio Público                          11
Ministerio de Educación e Innovación                              11
Ministerio de Desarrollo Humano y Hábitat                          2
Ministerio de Espacio Público e Higiene Urbana                     2
SECR Ciencia, Tecnologia e Innovacion                              2
SECR Comunicación, Contenidos y Participación Ciudadana            1
Ministerio de Hacienda y Finanzas                                  1
SECR Transformación Cultural                                       1
SECR Transporte y Obras Públicas                                   1
SECR Ambiente                                                      1
SECR Innovación y Transformación Digital                           1
SECR Asuntos Estratégicos                                          1
SECR General y Relaciones Internacionales                          1
SECR Desarrollo Urbano                                             1
Ministerio de Educación                                            1
Ministerio de Desarrollo Económico y Producción                    1
SECR Atención Ciudadana y Gestión Comunal                          1
Name: reparticion, dtype: int64

### Ejercicio: Volviendo al ejemplo del Titanic.

1) ¿Cuál era la edad promedio de los pasajeros de cada clase (Pclass)?

2) ¿Cuál fue la tarifa que pagaron en promedio los hombres? ¿Y las mujeres?

3) ¿Cuánto pagaron en total los pasajeros de primera clase para subir al Titanic? ¿Y los de tercera?

4) ¿Cuántos pasajeros había en cada tipo de clase?

In [205]:
df_titanic.head(1)

   PassengerId  Survived  Pclass  ...  Fare Cabin  Embarked
0            1         0       3  ...  7.25   NaN         S

[1 rows x 12 columns]

In [207]:
# 1) ¿Cuál era la edad promedio de los pasajeros de cada clase (Pclass)?
df_titanic.groupby('Pclass')['Age'].mean()

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

In [208]:
# 2) ¿Cuál fue la tarifa que pagaron en promedio los hombres? ¿Y las mujeres?
df_titanic.groupby('Sex')['Fare'].mean()

Sex
female    44.479818
male      25.523893
Name: Fare, dtype: float64

In [211]:
# 3) ¿Cuánto pagaron en total los pasajeros de primera clase para subir al Titanic? ¿Y los de tercera?
df_titanic.groupby('Pclass')['Fare'].sum()

Pclass
1    18177.4125
2     3801.8417
3     6714.6951
Name: Fare, dtype: float64

In [213]:
# 4) ¿Cuántos pasajeros había en cada tipo de clase?
df_titanic['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [214]:
df_titanic.groupby('Pclass')['Sex'].value_counts()

Pclass  Sex
1       male      122
        female     94
2       male      108
        female     76
3       male      347
        female    144
Name: Sex, dtype: int64

## Ordenar por columnas y limitar la cantidad de resultados

Otra forma de resolver el problema de encontrar el mayor y el menos es con el método sort_values. Este método puede recibir un valor único (nombre de columna) o una lista (con varias columnas) y un orden asc o desc. Por default el orden es asc.

Si combinamos el ordenamiento con el método head() para limitar la cantidad de resultados, podemos encontrar los N primeros.

In [215]:
# Recordemos cómo abrir la documentación de un método
df.sort_values?

In [216]:
# Calculamos el máximo
df.sort_values('total_salario_bruto_i_+_ii',ascending=False).head(1)

              cuil  anio  ...  total_salario_bruto_i_+_ii observaciones
374  20-13872301-2  2019  ...                   445945.31           NaN

[1 rows x 10 columns]

In [217]:
# Calculamos el mínimo
df.sort_values('total_salario_bruto_i_+_ii').head(1)

              cuil  anio  ...  total_salario_bruto_i_+_ii observaciones
344  27-30744939-6  2019  ...                   185396.54  baja al 9/12

[1 rows x 10 columns]

# Anexo: volviendo al tema de la vectorización

¿Por qué es tan importante trabajar con Pandas y no con funciones escritas por nosotros en Python nativo y que procesen los datos dentro de un for loop?

Por un lado está la comodidad. Hay mucha funcionalidad que ya está desarrollada en Pandas. Existen funciones que resuelven muchos de los problemas clásicos de manipular datos: agrupar, sumarizar, sacar estadísticas, filtrar, etc. Pero además hay una razón de performance. 

Veamos una demostración de que vectorizar es más eficiente. Vamos a crear dos listas de 1.000.000 de números aleatorios cada una y vamos a tratar de multiplicar elemento por elemento con pandas y sin pandas:

In [218]:
lista1 = list(np.random.randint(1, 100, 1000000))
lista2 = list(np.random.randint(1, 100, 1000000))

In [219]:
%%timeit 
for x,y in zip(lista1,lista2):
    x * y

10 loops, best of 5: 138 ms per loop

Ahora probemos hacer lo mismo con dos series de Pandas

In [220]:
serie1 = pd.Series(lista1)
serie2 = pd.Series(lista2)

In [221]:
%%timeit 
resultado = serie1 * serie2

100 loops, best of 5: 2.57 ms per loop

Conclusión: la operación vectorizada es <strong> más de 70 veces más rápida.</strong>